OSPP/OSPP2025/江飞兵-25aca0558-结项报告/lock-sched/test_db/benchmark_results_2025-08-26_08-45-53/cfs_128threads.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 128 tps: 4045.30 qps: 81096.01 (r/w/o: 56799.43/16193.18/8103.39) lat (ms,95%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 128 tps: 3099.91 qps: 62006.16 (r/w/o: 43391.51/12414.83/6199.82) lat (ms,95%): 71.83 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 128 tps: 2586.10 qps: 51688.23 (r/w/o: 36181.62/10334.51/5172.10) lat (ms,95%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 2241.70 qps: 44830.31 (r/w/o: 31379.71/8967.10/4483.50) lat (ms,95%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 128 tps: 2181.58 qps: 43689.20 (r/w/o: 30588.62/8737.42/4363.16) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 2137.31 qps: 42723.19 (r/w/o: 29912.91/8535.66/4274.63) lat (ms,95%): 170.48 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 128 tps: 2168.10 qps: 43375.26 (r/w/o: 30359.84/8679.21/4336.21) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 128 tps: 2202.01 qps: 44025.64 (r/w/o: 30822.40/8799.23/4404.01) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 128 tps: 2170.95 qps: 43413.09 (r/w/o: 30389.99/8681.20/4341.90) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 128 tps: 2236.14 qps: 44736.57 (r/w/o: 31315.11/8949.17/4472.29) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 128 tps: 2270.50 qps: 45363.89 (r/w/o: 31745.89/9077.10/4540.90) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 128 tps: 2366.00 qps: 47340.56 (r/w/o: 33132.44/9476.01/4732.11) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            4160604
        write:                           1188744
        other:                           594372
        total:                           5943720
    transactions:                        297186 (2475.09 per sec.)
    queries:                             5943720 (49501.77 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0704s
    total number of events:              297186

Latency (ms):
         min:                                    2.94
         avg:                                   51.69
         max:                                 2065.51
         95th percentile:                      125.52
         sum:                             15361068.71

Threads fairness:
    events (avg/stddev):           2321.7656/46.60
    execution time (avg/stddev):   120.0083/0.01